Autodesk.Navisworks.Api.DocumentParts.DocumentModels
Stores the collection of Models contained in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CollectionChanged
Occurs when the collection of Models has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CollectionChanging
Occurs when the collection of Models is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.Contains(Autodesk.Navisworks.Api.Model)
Determines whether the collection contains a specific value.
item: The Model to locate in the collection.
Returns: true if item is found in the collection; otherwise, false.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CopyTo(Autodesk.Navisworks.Api.Model[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.Model})
Copies the contents of the collection into to
to: The target collection
Throws System.ArgumentNullException:
to is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.Count
Gets the number of elements contained in the collection.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CreateCollection
Returns an empty collection associated with this Document

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CreateCollectionFromRootItems
Returns a snapshot collection containing the RootItem from each Autodesk.Navisworks.Api.Model

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CreateIndexPath(Autodesk.Navisworks.Api.ModelItem)
Returns a collection of indices that defines a path from the root item through its
descendants to the specified item.
Throws System.ArgumentException:
Item is not contained in this document part

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.CreatePathId(Autodesk.Navisworks.Api.ModelItem)
Return the path identifier that defines a path from the root item through its
descendants to the specified item, and the model index this item belongs to.
Throws System.ArgumentNullException:
Argument 'item' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.FindIdForModelItem(Autodesk.Navisworks.Api.ModelItem)
Returns numeric ID for a given model item.
Returns:
ID for model item, or 0 if no ID.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.FindModelItemsById(System.Int32,System.UInt64)
Returns collection of model items that have a given numeric ID.
Returns:
Model item collection containing requested items (if any).

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.First
Gets the first Model in the collection, returns null if the collection is empty

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.GetAllHiddenAtModelState
Gets the hidden status as defined by the constituent models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.IndexOf(Autodesk.Navisworks.Api.Model)
Determines the index of a specific item in the DocumentModels.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.IsFrozen(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Returns true if all items have their IsFrozen property set.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.IsHidden(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Returns true if all items have their Hidden property set.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.IsReadOnly
Gets a value indicating whether the collection is read-only.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.IsRequired(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Returns true if all items have their IsRequired property set.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.Item(System.Int32)


Autodesk.Navisworks.Api.DocumentParts.DocumentModels.MakeVisible(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Ensures the model items given and all of their children are visible.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ModelGeometryMaterialChanged
Occurs when the material (color or transparency) of any ModelGeometry
in the models has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ModelItemPropertiesChanged
Occurs when the editable properties (Hidden or Required) of any ModelItem
in the models has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ModelTransformChanged
Occurs when the units or transform of a Model has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ModelTransformChanging
Occurs when the units or transform of a Model are about to change.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.OverridePermanentColor(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},Autodesk.Navisworks.Api.Color)
Overrides the permanent color of all ModelGeometry descendants
of items.
Throws System.ArgumentNullException:
items is null
Throws System.ArgumentNullException:
color is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.OverridePermanentTransform(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},Autodesk.Navisworks.Api.Transform3D,System.Boolean)
Apply an incremental transform to a selection.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.OverridePermanentTransparency(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},System.Double)
Overrides the permanent transparency of all ModelGeometry descendants
of items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.OverrideTemporaryColor(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},Autodesk.Navisworks.Api.Color)
Overrides the temporary color of all ModelGeometry descendants
of items.
Throws System.ArgumentNullException:
items is null
Throws System.ArgumentNullException:
color is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.OverrideTemporaryTransparency(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},System.Double)
Overrides the temporary transparency of all ModelGeometry descendants
of items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllFrozen
Clears the IsFrozen property on all items in the models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllHidden
Clears the IsHidden property on all items in the models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllHiddenToModelState
Resets the hidden status to that defined in the constituent models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllPermanentMaterials
Resets permanent material properties (color and transparency) of
all ModelGeometry in the models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllPermanentTransforms
Reset incremental transforms for all model items contained in the entire model.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllRequired
Clears the IsRequired property on all items in the models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetAllTemporaryMaterials
Resets temporary material properties (color and transparency) of
all ModelGeometry in the models.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetPermanentMaterials(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Resets permanent material properties (color and transparency) of
all ModelGeometry descendants of items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetPermanentTransform(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Reset incremental transforms for all model items contained in the selection.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResetTemporaryMaterials(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Resets temporary material properties (color and transparency) of
all ModelGeometry descendants of items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResolveIndexPath(System.Collections.Generic.IEnumerable{System.Int32})
Returns the saved item referenced by a collection of indices that define a path from the
root item through its descendants to the specified item.
Returns:
null if source cannot be resolved
Throws System.ArgumentNullException:
Argument 'path' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.ResolvePathId(Autodesk.Navisworks.Api.DocumentParts.ModelItemPathId)
Returns the saved item referenced by a model index and a path identifier that
define a path from the root item through its descendants to the specified item.
Returns:
null if source cannot be resolved
Throws System.ArgumentNullException:
Argument 'pathId' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.RootItemDescendants
All descendants of RootItems (excluding the RootItems themselves).

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.RootItemDescendantsAndSelf
All descendants of RootItems (including the RootItems themselves).

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.RootItems
The RootItem from each model

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.SceneLoaded
Occurs whenever a new scene is loaded (or reloaded). This is meant only for internal
Navisworks usage.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.SetFrozen(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},System.Boolean)
Sets the IsFrozen property on all instances of specified items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.SetHidden(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},System.Boolean)
Sets the IsHidden property on all instances of specified items.
Throws System.ArgumentNullException:
items is null

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.SetModelUnitsAndTransform(Autodesk.Navisworks.Api.Model,Autodesk.Navisworks.Api.Units,Autodesk.Navisworks.Api.Transform3D,System.Boolean)
Sets the model units and transform.

Autodesk.Navisworks.Api.DocumentParts.DocumentModels.SetRequired(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem},System.Boolean)
Sets the IsRequired property on all instances of specified items.
Throws System.ArgumentNullException:
items is null